; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	image1 - mode
	Star9 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star4 - direction
	Star0 - direction
	Star8 - direction
	Star2 - direction
	Star1 - direction
	Star3 - direction
	Star7 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star3)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star4)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(supports instrument7 image0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 Star7)
	(supports instrument8 image1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
)
(:goal (and
	(pointing satellite2 Star3)
	(pointing satellite3 Phenomenon15)
	(have_image Planet10 image1)
	(have_image Planet11 image0)
	(have_image Phenomenon12 image0)
	(have_image Planet13 image1)
	(have_image Star14 image0)
	(have_image Phenomenon15 image0)
	(have_image Planet16 image1)
	(have_image Star17 image1)
	(have_image Star18 image1)
))

)

; plan
1. (turn_to satellite3 star2 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star2)
   goals met: 0 of 11
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 11
3. (calibrate satellite3 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 11
4. (turn_to satellite3 planet13 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet13)
   goals met: 0 of 11
5. (take_image satellite3 planet13 instrument7 image1)
   added: (have_image planet13 image1)
   goals met: 1 of 11
6. (turn_to satellite3 planet11 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet11)
   goals met: 1 of 11
7. (take_image satellite3 planet11 instrument7 image0)
   added: (have_image planet11 image0)
   goals met: 2 of 11
8. (turn_to satellite3 planet10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet10)
   goals met: 2 of 11
9. (take_image satellite3 planet10 instrument7 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 11
10. (turn_to satellite3 phenomenon12 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon12)
   goals met: 3 of 11
11. (turn_to satellite2 star3 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 star3)
   goals met: 4 of 11
12. (take_image satellite3 phenomenon12 instrument7 image0)
   added: (have_image phenomenon12 image0)
   goals met: 5 of 11
13. (turn_to satellite3 planet16 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet16)
   goals met: 5 of 11
14. (take_image satellite3 planet16 instrument7 image1)
   added: (have_image planet16 image1)
   goals met: 6 of 11
15. (turn_to satellite3 star14 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 star14)
   goals met: 6 of 11
16. (take_image satellite3 star14 instrument7 image0)
   added: (have_image star14 image0)
   goals met: 7 of 11
17. (turn_to satellite3 star17 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star17)
   goals met: 7 of 11
18. (take_image satellite3 star17 instrument7 image1)
   added: (have_image star17 image1)
   goals met: 8 of 11
19. (turn_to satellite3 star18 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 star18)
   goals met: 8 of 11
20. (take_image satellite3 star18 instrument7 image1)
   added: (have_image star18 image1)
   goals met: 9 of 11
21. (turn_to satellite3 phenomenon15 star18)
   deleted: (pointing satellite3 star18)
   added: (pointing satellite3 phenomenon15)
   goals met: 10 of 11
22. (take_image satellite3 phenomenon15 instrument7 image0)
   added: (have_image phenomenon15 image0)
   goals met: 11 of 11
